----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 64, 64]           9,408
            Conv2d-2           [-1, 64, 64, 64]           9,408
       BatchNorm2d-3           [-1, 64, 64, 64]             128
       BatchNorm2d-4           [-1, 64, 64, 64]             128
              ReLU-5           [-1, 64, 64, 64]               0
              ReLU-6           [-1, 64, 64, 64]               0
         MaxPool2d-7           [-1, 64, 32, 32]               0
         MaxPool2d-8           [-1, 64, 32, 32]               0
            Conv2d-9           [-1, 64, 32, 32]          36,864
           Conv2d-10           [-1, 64, 32, 32]          36,864
      BatchNorm2d-11           [-1, 64, 32, 32]             128
      BatchNorm2d-12           [-1, 64, 32, 32]             128
             ReLU-13           [-1, 64, 32, 32]               0
             ReLU-14           [-1, 64, 32, 32]               0
           Conv2d-15           [-1, 64, 32, 32]          36,864
           Conv2d-16           [-1, 64, 32, 32]          36,864
      BatchNorm2d-17           [-1, 64, 32, 32]             128
      BatchNorm2d-18           [-1, 64, 32, 32]             128
             ReLU-19           [-1, 64, 32, 32]               0
             ReLU-20           [-1, 64, 32, 32]               0
       BasicBlock-21           [-1, 64, 32, 32]               0
       BasicBlock-22           [-1, 64, 32, 32]               0
           Conv2d-23           [-1, 64, 32, 32]          36,864
           Conv2d-24           [-1, 64, 32, 32]          36,864
      BatchNorm2d-25           [-1, 64, 32, 32]             128
      BatchNorm2d-26           [-1, 64, 32, 32]             128
             ReLU-27           [-1, 64, 32, 32]               0
             ReLU-28           [-1, 64, 32, 32]               0
           Conv2d-29           [-1, 64, 32, 32]          36,864
           Conv2d-30           [-1, 64, 32, 32]          36,864
      BatchNorm2d-31           [-1, 64, 32, 32]             128
      BatchNorm2d-32           [-1, 64, 32, 32]             128
             ReLU-33           [-1, 64, 32, 32]               0
             ReLU-34           [-1, 64, 32, 32]               0
       BasicBlock-35           [-1, 64, 32, 32]               0
       BasicBlock-36           [-1, 64, 32, 32]               0
           Conv2d-37           [-1, 64, 32, 32]          36,864
           Conv2d-38           [-1, 64, 32, 32]          36,864
      BatchNorm2d-39           [-1, 64, 32, 32]             128
      BatchNorm2d-40           [-1, 64, 32, 32]             128
             ReLU-41           [-1, 64, 32, 32]               0
             ReLU-42           [-1, 64, 32, 32]               0
           Conv2d-43           [-1, 64, 32, 32]          36,864
           Conv2d-44           [-1, 64, 32, 32]          36,864
      BatchNorm2d-45           [-1, 64, 32, 32]             128
      BatchNorm2d-46           [-1, 64, 32, 32]             128
             ReLU-47           [-1, 64, 32, 32]               0
             ReLU-48           [-1, 64, 32, 32]               0
       BasicBlock-49           [-1, 64, 32, 32]               0
       BasicBlock-50           [-1, 64, 32, 32]               0
           Conv2d-51          [-1, 128, 16, 16]          73,728
           Conv2d-52          [-1, 128, 16, 16]          73,728
      BatchNorm2d-53          [-1, 128, 16, 16]             256
      BatchNorm2d-54          [-1, 128, 16, 16]             256
             ReLU-55          [-1, 128, 16, 16]               0
             ReLU-56          [-1, 128, 16, 16]               0
           Conv2d-57          [-1, 128, 16, 16]         147,456
           Conv2d-58          [-1, 128, 16, 16]         147,456
      BatchNorm2d-59          [-1, 128, 16, 16]             256
      BatchNorm2d-60          [-1, 128, 16, 16]             256
           Conv2d-61          [-1, 128, 16, 16]           8,192
           Conv2d-62          [-1, 128, 16, 16]           8,192
      BatchNorm2d-63          [-1, 128, 16, 16]             256
      BatchNorm2d-64          [-1, 128, 16, 16]             256
             ReLU-65          [-1, 128, 16, 16]               0
             ReLU-66          [-1, 128, 16, 16]               0
       BasicBlock-67          [-1, 128, 16, 16]               0
       BasicBlock-68          [-1, 128, 16, 16]               0
           Conv2d-69          [-1, 128, 16, 16]         147,456
           Conv2d-70          [-1, 128, 16, 16]         147,456
      BatchNorm2d-71          [-1, 128, 16, 16]             256
      BatchNorm2d-72          [-1, 128, 16, 16]             256
             ReLU-73          [-1, 128, 16, 16]               0
             ReLU-74          [-1, 128, 16, 16]               0
           Conv2d-75          [-1, 128, 16, 16]         147,456
           Conv2d-76          [-1, 128, 16, 16]         147,456
      BatchNorm2d-77          [-1, 128, 16, 16]             256
      BatchNorm2d-78          [-1, 128, 16, 16]             256
             ReLU-79          [-1, 128, 16, 16]               0
             ReLU-80          [-1, 128, 16, 16]               0
       BasicBlock-81          [-1, 128, 16, 16]               0
       BasicBlock-82          [-1, 128, 16, 16]               0
           Conv2d-83          [-1, 128, 16, 16]         147,456
           Conv2d-84          [-1, 128, 16, 16]         147,456
      BatchNorm2d-85          [-1, 128, 16, 16]             256
      BatchNorm2d-86          [-1, 128, 16, 16]             256
             ReLU-87          [-1, 128, 16, 16]               0
             ReLU-88          [-1, 128, 16, 16]               0
           Conv2d-89          [-1, 128, 16, 16]         147,456
           Conv2d-90          [-1, 128, 16, 16]         147,456
      BatchNorm2d-91          [-1, 128, 16, 16]             256
      BatchNorm2d-92          [-1, 128, 16, 16]             256
             ReLU-93          [-1, 128, 16, 16]               0
             ReLU-94          [-1, 128, 16, 16]               0
       BasicBlock-95          [-1, 128, 16, 16]               0
       BasicBlock-96          [-1, 128, 16, 16]               0
           Conv2d-97          [-1, 128, 16, 16]         147,456
           Conv2d-98          [-1, 128, 16, 16]         147,456
      BatchNorm2d-99          [-1, 128, 16, 16]             256
     BatchNorm2d-100          [-1, 128, 16, 16]             256
            ReLU-101          [-1, 128, 16, 16]               0
            ReLU-102          [-1, 128, 16, 16]               0
          Conv2d-103          [-1, 128, 16, 16]         147,456
          Conv2d-104          [-1, 128, 16, 16]         147,456
     BatchNorm2d-105          [-1, 128, 16, 16]             256
     BatchNorm2d-106          [-1, 128, 16, 16]             256
            ReLU-107          [-1, 128, 16, 16]               0
            ReLU-108          [-1, 128, 16, 16]               0
      BasicBlock-109          [-1, 128, 16, 16]               0
      BasicBlock-110          [-1, 128, 16, 16]               0
          Conv2d-111            [-1, 256, 8, 8]         294,912
          Conv2d-112            [-1, 256, 8, 8]         294,912
     BatchNorm2d-113            [-1, 256, 8, 8]             512
     BatchNorm2d-114            [-1, 256, 8, 8]             512
            ReLU-115            [-1, 256, 8, 8]               0
            ReLU-116            [-1, 256, 8, 8]               0
          Conv2d-117            [-1, 256, 8, 8]         589,824
          Conv2d-118            [-1, 256, 8, 8]         589,824
     BatchNorm2d-119            [-1, 256, 8, 8]             512
     BatchNorm2d-120            [-1, 256, 8, 8]             512
          Conv2d-121            [-1, 256, 8, 8]          32,768
          Conv2d-122            [-1, 256, 8, 8]          32,768
     BatchNorm2d-123            [-1, 256, 8, 8]             512
     BatchNorm2d-124            [-1, 256, 8, 8]             512
            ReLU-125            [-1, 256, 8, 8]               0
            ReLU-126            [-1, 256, 8, 8]               0
      BasicBlock-127            [-1, 256, 8, 8]               0
      BasicBlock-128            [-1, 256, 8, 8]               0
          Conv2d-129            [-1, 256, 8, 8]         589,824
          Conv2d-130            [-1, 256, 8, 8]         589,824
     BatchNorm2d-131            [-1, 256, 8, 8]             512
     BatchNorm2d-132            [-1, 256, 8, 8]             512
            ReLU-133            [-1, 256, 8, 8]               0
            ReLU-134            [-1, 256, 8, 8]               0
          Conv2d-135            [-1, 256, 8, 8]         589,824
          Conv2d-136            [-1, 256, 8, 8]         589,824
     BatchNorm2d-137            [-1, 256, 8, 8]             512
     BatchNorm2d-138            [-1, 256, 8, 8]             512
            ReLU-139            [-1, 256, 8, 8]               0
            ReLU-140            [-1, 256, 8, 8]               0
      BasicBlock-141            [-1, 256, 8, 8]               0
      BasicBlock-142            [-1, 256, 8, 8]               0
          Conv2d-143            [-1, 256, 8, 8]         589,824
          Conv2d-144            [-1, 256, 8, 8]         589,824
     BatchNorm2d-145            [-1, 256, 8, 8]             512
     BatchNorm2d-146            [-1, 256, 8, 8]             512
            ReLU-147            [-1, 256, 8, 8]               0
            ReLU-148            [-1, 256, 8, 8]               0
          Conv2d-149            [-1, 256, 8, 8]         589,824
          Conv2d-150            [-1, 256, 8, 8]         589,824
     BatchNorm2d-151            [-1, 256, 8, 8]             512
     BatchNorm2d-152            [-1, 256, 8, 8]             512
            ReLU-153            [-1, 256, 8, 8]               0
            ReLU-154            [-1, 256, 8, 8]               0
      BasicBlock-155            [-1, 256, 8, 8]               0
      BasicBlock-156            [-1, 256, 8, 8]               0
          Conv2d-157            [-1, 256, 8, 8]         589,824
          Conv2d-158            [-1, 256, 8, 8]         589,824
     BatchNorm2d-159            [-1, 256, 8, 8]             512
     BatchNorm2d-160            [-1, 256, 8, 8]             512
            ReLU-161            [-1, 256, 8, 8]               0
            ReLU-162            [-1, 256, 8, 8]               0
          Conv2d-163            [-1, 256, 8, 8]         589,824
          Conv2d-164            [-1, 256, 8, 8]         589,824
     BatchNorm2d-165            [-1, 256, 8, 8]             512
     BatchNorm2d-166            [-1, 256, 8, 8]             512
            ReLU-167            [-1, 256, 8, 8]               0
            ReLU-168            [-1, 256, 8, 8]               0
      BasicBlock-169            [-1, 256, 8, 8]               0
      BasicBlock-170            [-1, 256, 8, 8]               0
          Conv2d-171            [-1, 256, 8, 8]         589,824
          Conv2d-172            [-1, 256, 8, 8]         589,824
     BatchNorm2d-173            [-1, 256, 8, 8]             512
     BatchNorm2d-174            [-1, 256, 8, 8]             512
            ReLU-175            [-1, 256, 8, 8]               0
            ReLU-176            [-1, 256, 8, 8]               0
          Conv2d-177            [-1, 256, 8, 8]         589,824
          Conv2d-178            [-1, 256, 8, 8]         589,824
     BatchNorm2d-179            [-1, 256, 8, 8]             512
     BatchNorm2d-180            [-1, 256, 8, 8]             512
            ReLU-181            [-1, 256, 8, 8]               0
            ReLU-182            [-1, 256, 8, 8]               0
      BasicBlock-183            [-1, 256, 8, 8]               0
      BasicBlock-184            [-1, 256, 8, 8]               0
          Conv2d-185            [-1, 256, 8, 8]         589,824
          Conv2d-186            [-1, 256, 8, 8]         589,824
     BatchNorm2d-187            [-1, 256, 8, 8]             512
     BatchNorm2d-188            [-1, 256, 8, 8]             512
            ReLU-189            [-1, 256, 8, 8]               0
            ReLU-190            [-1, 256, 8, 8]               0
          Conv2d-191            [-1, 256, 8, 8]         589,824
          Conv2d-192            [-1, 256, 8, 8]         589,824
     BatchNorm2d-193            [-1, 256, 8, 8]             512
     BatchNorm2d-194            [-1, 256, 8, 8]             512
            ReLU-195            [-1, 256, 8, 8]               0
            ReLU-196            [-1, 256, 8, 8]               0
      BasicBlock-197            [-1, 256, 8, 8]               0
      BasicBlock-198            [-1, 256, 8, 8]               0
          Conv2d-199            [-1, 512, 4, 4]       1,179,648
          Conv2d-200            [-1, 512, 4, 4]       1,179,648
     BatchNorm2d-201            [-1, 512, 4, 4]           1,024
     BatchNorm2d-202            [-1, 512, 4, 4]           1,024
            ReLU-203            [-1, 512, 4, 4]               0
            ReLU-204            [-1, 512, 4, 4]               0
          Conv2d-205            [-1, 512, 4, 4]       2,359,296
          Conv2d-206            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-207            [-1, 512, 4, 4]           1,024
     BatchNorm2d-208            [-1, 512, 4, 4]           1,024
          Conv2d-209            [-1, 512, 4, 4]         131,072
          Conv2d-210            [-1, 512, 4, 4]         131,072
     BatchNorm2d-211            [-1, 512, 4, 4]           1,024
     BatchNorm2d-212            [-1, 512, 4, 4]           1,024
            ReLU-213            [-1, 512, 4, 4]               0
            ReLU-214            [-1, 512, 4, 4]               0
      BasicBlock-215            [-1, 512, 4, 4]               0
      BasicBlock-216            [-1, 512, 4, 4]               0
          Conv2d-217            [-1, 512, 4, 4]       2,359,296
          Conv2d-218            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-219            [-1, 512, 4, 4]           1,024
     BatchNorm2d-220            [-1, 512, 4, 4]           1,024
            ReLU-221            [-1, 512, 4, 4]               0
            ReLU-222            [-1, 512, 4, 4]               0
          Conv2d-223            [-1, 512, 4, 4]       2,359,296
          Conv2d-224            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-225            [-1, 512, 4, 4]           1,024
     BatchNorm2d-226            [-1, 512, 4, 4]           1,024
            ReLU-227            [-1, 512, 4, 4]               0
            ReLU-228            [-1, 512, 4, 4]               0
      BasicBlock-229            [-1, 512, 4, 4]               0
      BasicBlock-230            [-1, 512, 4, 4]               0
          Conv2d-231            [-1, 512, 4, 4]       2,359,296
          Conv2d-232            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-233            [-1, 512, 4, 4]           1,024
     BatchNorm2d-234            [-1, 512, 4, 4]           1,024
            ReLU-235            [-1, 512, 4, 4]               0
            ReLU-236            [-1, 512, 4, 4]               0
          Conv2d-237            [-1, 512, 4, 4]       2,359,296
          Conv2d-238            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-239            [-1, 512, 4, 4]           1,024
     BatchNorm2d-240            [-1, 512, 4, 4]           1,024
            ReLU-241            [-1, 512, 4, 4]               0
            ReLU-242            [-1, 512, 4, 4]               0
      BasicBlock-243            [-1, 512, 4, 4]               0
      BasicBlock-244            [-1, 512, 4, 4]               0
       MaxPool2d-245            [-1, 512, 2, 2]               0
       MaxPool2d-246            [-1, 512, 2, 2]               0
     Interpolate-247            [-1, 512, 4, 4]               0
          Conv2d-248            [-1, 256, 4, 4]       1,179,904
            ReLU-249            [-1, 256, 4, 4]               0
        ConvRelu-250            [-1, 256, 4, 4]               0
          Conv2d-251            [-1, 128, 4, 4]         295,040
            ReLU-252            [-1, 128, 4, 4]               0
        ConvRelu-253            [-1, 128, 4, 4]               0
  DecoderBlockV2-254            [-1, 128, 4, 4]               0
     Interpolate-255            [-1, 640, 8, 8]               0
          Conv2d-256            [-1, 256, 8, 8]       1,474,816
            ReLU-257            [-1, 256, 8, 8]               0
        ConvRelu-258            [-1, 256, 8, 8]               0
          Conv2d-259            [-1, 128, 8, 8]         295,040
            ReLU-260            [-1, 128, 8, 8]               0
        ConvRelu-261            [-1, 128, 8, 8]               0
  DecoderBlockV2-262            [-1, 128, 8, 8]               0
     Interpolate-263          [-1, 384, 16, 16]               0
          Conv2d-264          [-1, 256, 16, 16]         884,992
            ReLU-265          [-1, 256, 16, 16]               0
        ConvRelu-266          [-1, 256, 16, 16]               0
          Conv2d-267          [-1, 128, 16, 16]         295,040
            ReLU-268          [-1, 128, 16, 16]               0
        ConvRelu-269          [-1, 128, 16, 16]               0
  DecoderBlockV2-270          [-1, 128, 16, 16]               0
     Interpolate-271          [-1, 256, 32, 32]               0
          Conv2d-272          [-1, 128, 32, 32]         295,040
            ReLU-273          [-1, 128, 32, 32]               0
        ConvRelu-274          [-1, 128, 32, 32]               0
          Conv2d-275           [-1, 32, 32, 32]          36,896
            ReLU-276           [-1, 32, 32, 32]               0
        ConvRelu-277           [-1, 32, 32, 32]               0
  DecoderBlockV2-278           [-1, 32, 32, 32]               0
     Interpolate-279           [-1, 96, 64, 64]               0
          Conv2d-280           [-1, 64, 64, 64]          55,360
            ReLU-281           [-1, 64, 64, 64]               0
        ConvRelu-282           [-1, 64, 64, 64]               0
          Conv2d-283           [-1, 64, 64, 64]          36,928
            ReLU-284           [-1, 64, 64, 64]               0
        ConvRelu-285           [-1, 64, 64, 64]               0
  DecoderBlockV2-286           [-1, 64, 64, 64]               0
     Interpolate-287         [-1, 64, 128, 128]               0
          Conv2d-288         [-1, 64, 128, 128]          36,928
            ReLU-289         [-1, 64, 128, 128]               0
        ConvRelu-290         [-1, 64, 128, 128]               0
          Conv2d-291         [-1, 16, 128, 128]           9,232
            ReLU-292         [-1, 16, 128, 128]               0
        ConvRelu-293         [-1, 16, 128, 128]               0
  DecoderBlockV2-294         [-1, 16, 128, 128]               0
          Conv2d-295         [-1, 16, 128, 128]           2,320
            ReLU-296         [-1, 16, 128, 128]               0
        ConvRelu-297         [-1, 16, 128, 128]               0
          Conv2d-298          [-1, 5, 128, 128]              85
================================================================
Total params: 47,466,965
Trainable params: 47,466,965
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 136.94
Params size (MB): 181.07
Estimated Total Size (MB): 318.20
----------------------------------------------------------------
